bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA328PB.xml
                <instance name="TC4">
                    <register-group name="TC4" name-in-module="TC4" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="T" function="default" pad="PE1"/>
                        <signal group="ICP" function="default" pad="PE0"/>
                        <signal group="OCA" function="default" pad="PD1"/>
                        <signal group="OCB" function="default" pad="PD2"/>
                    </signals>
                </instance>
            </module>
            <module name="TC8_ASYNC">
                <instance name="TC2">
                    <register-group name="TC2" name-in-module="TC2" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="OCA" function="default" pad="PB3"/>
                        <signal group="OCB" function="default" pad="PD3"/>
                    </signals>
                </instance>
            </module>
            <module name="ADC">
                <instance name="ADC">
                    <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="ADC" index="0" function="default" pad="PC0"/>
                        <signal group="ADC" index="1" function="default" pad="PC1"/>
                        <signal group="ADC" index="2" function="default" pad="PC2"/>
                        <signal group="ADC" index="3" function="default" pad="PC3"/>
                        <signal group="ADC" index="4" function="default" pad="PC4"/>
                        <signal group="ADC" index="5" function="default" pad="PC5"/>
                        <signal group="ADC" index="6" function="default" pad="PE2"/>
                        <signal group="ADC" index="7" function="default" pad="PE3"/>
                    </signals>
                </instance>
            </module>
            <module name="AC">
                <instance name="AC">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="AC" function="default" pad="PE0"/>
                        <signal group="AIN" index="0" function="default" pad="PD6"/>
                        <signal group="AIN" index="1" function="default" pad="PD7"/>
                    </signals>
                </instance>
            </module>
            <module name="PORT">
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PB0" index="0"/>
                        <signal group="P" function="default" pad="PB1" index="1"/>
                        <signal group="P" function="default" pad="PB2" index="2"/>
                        <signal group="P" function="default" pad="PB3" index="3"/>
                        <signal group="P" function="default" pad="PB4" index="4"/>
                        <signal group="P" function="default" pad="PB5" index="5"/>
                        <signal group="P" function="default" pad="PB6" index="6"/>
                        <signal group="P" function="default" pad="PB7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTC" caption="I/O Port">
                    <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PC0" index="0"/>
                        <signal group="P" function="default" pad="PC1" index="1"/>
                        <signal group="P" function="default" pad="PC2" index="2"/>
                        <signal group="P" function="default" pad="PC3" index="3"/>
                        <signal group="P" function="default" pad="PC4" index="4"/>
                        <signal group="P" function="default" pad="PC5" index="5"/>
                        <signal group="P" function="default" pad="PC6" index="6"/>
                    </signals>
                </instance>
                <instance name="PORTD" caption="I/O Port">
                    <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PD0" index="0"/>
                        <signal group="P" function="default" pad="PD1" index="1"/>
                        <signal group="P" function="default" pad="PD2" index="2"/>
                        <signal group="P" function="default" pad="PD3" index="3"/>
                        <signal group="P" function="default" pad="PD4" index="4"/>
                        <signal group="P" function="default" pad="PD5" index="5"/>
                        <signal group="P" function="default" pad="PD6" index="6"/>
                        <signal group="P" function="default" pad="PD7" index="7"/>
                    </signals>
                </instance>
                <instance name="PORTE" caption="I/O Port">
                    <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal group="P" function="default" pad="PE0" index="0"/>
                        <signal group="P" function="default" pad="PE1" index="1"/>
                        <signal group="P" function="default" pad="PE2" index="2"/>
                        <signal group="P" function="default" pad="PE3" index="3"/>
                    </signals>
                </instance>
            </module>
