bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA328PB.xml
            <module name="TC8">
                <instance name="TC0">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="T" function="default" pad="PD4"/>
                        <signal group="OCB" function="default" pad="PD5"/>
                        <signal group="OCA" function="default" pad="PD6"/>
                    </signals>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="INT" index="1" function="default" pad="PD3"/>
                        <signal group="PCINT" index="19" function="default" pad="PD3"/>
                        <signal group="PCINT" index="20" function="default" pad="PD4"/>
                        <signal group="PCINT" index="24" function="default" pad="PE0"/>
                        <signal group="PCINT" index="25" function="default" pad="PE1"/>
                        <signal group="PCINT" index="6" function="default" pad="PB6"/>
                        <signal group="PCINT" index="7" function="default" pad="PB7"/>
                        <signal group="PCINT" index="21" function="default" pad="PD5"/>
                        <signal group="PCINT" index="22" function="default" pad="PD6"/>
                        <signal group="PCINT" index="23" function="default" pad="PD7"/>
                        <signal group="PCINT" index="0" function="default" pad="PB0"/>
                        <signal group="PCINT" index="1" function="default" pad="PB1"/>
                        <signal group="PCINT" index="2" function="default" pad="PB2"/>
                        <signal group="PCINT" index="3" function="default" pad="PB3"/>
                        <signal group="PCINT" index="4" function="default" pad="PB4"/>
                        <signal group="PCINT" index="5" function="default" pad="PB5"/>
                        <signal group="PCINT" index="27" function="default" pad="PE2"/>
                        <signal group="PCINT" index="8" function="default" pad="PC0"/>
                        <signal group="PCINT" index="9" function="default" pad="PC1"/>
                        <signal group="PCINT" index="10" function="default" pad="PC2"/>
                        <signal group="PCINT" index="11" function="default" pad="PC3"/>
                        <signal group="PCINT" index="12" function="default" pad="PC4"/>
                        <signal group="PCINT" index="13" function="default" pad="PC5"/>
                        <signal group="PCINT" index="14" function="default" pad="PC6"/>
                        <signal group="PCINT" index="16" function="default" pad="PD0"/>
                        <signal group="PCINT" index="17" function="default" pad="PD1"/>
                        <signal group="PCINT" index="18" function="default" pad="PD2"/>
                        <signal group="INT" index="0" function="default" pad="PD2"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI0">
                    <register-group name="SPI0" name-in-module="SPI0" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="SS" function="default" pad="PB2"/>
                        <signal group="MOSI" function="default" pad="PB3"/>
                        <signal group="MISO" function="default" pad="PB4"/>
                        <signal group="SCK" function="default" pad="PB5"/>
                    </signals>
                </instance>
                <instance name="SPI1">
                    <register-group name="SPI1" name-in-module="SPI1" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="SS" function="default" pad="PE2"/>
                        <signal group="SCK" function="default" pad="PC1"/>
                        <signal group="MISO" function="default" pad="PC0"/>
                        <signal group="MOSI" function="default" pad="PE3"/>
                    </signals>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"/>
                </instance>
            </module>
            <module name="PTC">
                <instance name="PTC">
                    <signals>
                        <signal group="X" index="00" function="default" pad="PD0"/>
                        <signal group="X" index="01" function="default" pad="PD1"/>
                        <signal group="X" index="02" function="default" pad="PD2"/>
                        <signal group="X" index="03" function="default" pad="PD3"/>
                        <signal group="X" index="04" function="default" pad="PD4"/>
                        <signal group="X" index="05" function="default" pad="PD5"/>
                        <signal group="X" index="06" function="default" pad="PD6"/>
                        <signal group="X" index="07" function="default" pad="PD7"/>
                        <signal group="X" index="08" function="default" pad="PE0"/>
                        <signal group="X" index="09" function="default" pad="PE1"/>
                        <signal group="X" index="10" function="default" pad="PB0"/>
                        <signal group="X" index="11" function="default" pad="PB1"/>
                        <signal group="X" index="12" function="default" pad="PB2"/>
                        <signal group="X" index="13" function="default" pad="PB3"/>
                        <signal group="X" index="14" function="default" pad="PB4"/>
                        <signal group="X" index="15" function="default" pad="PB5"/>
                        <signal group="Y" index="00" function="default" pad="PC0"/>
                        <signal group="Y" index="01" function="default" pad="PC1"/>
                        <signal group="Y" index="02" function="default" pad="PC2"/>
                        <signal group="Y" index="03" function="default" pad="PC3"/>
                        <signal group="Y" index="04" function="default" pad="PC4"/>
                        <signal group="Y" index="05" function="default" pad="PC5"/>
                        <signal group="Y" index="06" function="default" pad="PE2"/>
                        <signal group="Y" index="07" function="default" pad="PE3"/>
                        <signal group="Y" index="08" function="default" pad="PD0"/>
                        <signal group="Y" index="09" function="default" pad="PD1"/>
                        <signal group="Y" index="10" function="default" pad="PD2"/>
                        <signal group="Y" index="11" function="default" pad="PD3"/>
                        <signal group="Y" index="12" function="default" pad="PD4"/>
                        <signal group="Y" index="13" function="default" pad="PD5"/>
                        <signal group="Y" index="14" function="default" pad="PD6"/>
                        <signal group="Y" index="15" function="default" pad="PD7"/>
                        <signal group="Y" index="16" function="default" pad="PE0"/>
                        <signal group="Y" index="17" function="default" pad="PE1"/>
                        <signal group="Y" index="18" function="default" pad="PB0"/>
                        <signal group="Y" index="19" function="default" pad="PB1"/>
                        <signal group="Y" index="20" function="default" pad="PB2"/>
                        <signal group="Y" index="21" function="default" pad="PB3"/>
                        <signal group="Y" index="22" function="default" pad="PB4"/>
                        <signal group="Y" index="23" function="default" pad="PB5"/>
                    </signals>
                </instance>
            </module>
