bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA328PB.xml
            <module name="CPU">
                <instance name="CPU">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"/>
                    <signals>
                        <signal group="CLK" index="0" function="default" pad="PB0"/>
                    </signals>
                    <parameters>
                        <param name="CORE_VERSION" value="V2E"/>
                    </parameters>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"/>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"/>
                </instance>
            </module>
            <module name="LOCKBIT">
                <instance name="LOCKBIT">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"/>
                </instance>
            </module>
            <module name="CFD">
                <instance name="CFD">
                    <register-group name="CFD" name-in-module="CFD" offset="0x00" address-space="data"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt index="0" name="RESET"
                       caption="External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset"/>
            <interrupt index="1" name="INT0" caption="External Interrupt Request 0"/>
            <interrupt index="2" name="INT1" caption="External Interrupt Request 1"/>
            <interrupt index="3" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
            <interrupt index="4" name="PCINT1" caption="Pin Change Interrupt Request 1"/>
            <interrupt index="5" name="PCINT2" caption="Pin Change Interrupt Request 2"/>
            <interrupt index="6" name="WDT" caption="Watchdog Time-out Interrupt"/>
            <interrupt index="7" name="TIMER2_COMPA" caption="Timer/Counter2 Compare Match A"/>
            <interrupt index="8" name="TIMER2_COMPB" caption="Timer/Counter2 Compare Match B"/>
            <interrupt index="9" name="TIMER2_OVF" caption="Timer/Counter2 Overflow"/>
            <interrupt index="10" name="TIMER1_CAPT" caption="Timer/Counter1 Capture Event"/>
            <interrupt index="11" name="TIMER1_COMPA" caption="Timer/Counter1 Compare Match A"/>
            <interrupt index="12" name="TIMER1_COMPB" caption="Timer/Counter1 Compare Match B"/>
            <interrupt index="13" name="TIMER1_OVF" caption="Timer/Counter1 Overflow"/>
            <interrupt index="14" name="TIMER0_COMPA" caption="TimerCounter0 Compare Match A"/>
            <interrupt index="15" name="TIMER0_COMPB" caption="TimerCounter0 Compare Match B"/>
            <interrupt index="16" name="TIMER0_OVF" caption="Timer/Couner0 Overflow"/>
            <interrupt index="17" name="SPI0_STC" caption="SPI Serial Transfer Complete"/>
            <interrupt index="18" name="USART0_RX" caption="USART0 Rx Complete"/>
            <interrupt index="19" name="USART0_UDRE" caption="USART0, Data Register Empty"/>
            <interrupt index="20" name="USART0_TX" caption="USART0 Tx Complete"/>
            <interrupt index="21" name="ADC" caption="ADC Conversion Complete"/>
            <interrupt index="22" name="EE_READY" caption="EEPROM Ready"/>
            <interrupt index="23" name="ANALOG_COMP" caption="Analog Comparator"/>
            <interrupt index="24" name="TWI0" caption="Two-wire Serial Interface"/>
            <interrupt index="25" name="SPM_Ready" caption="Store Program Memory Read"/>
            <interrupt index="26" name="USART0_START" caption="USART0 Start frame detection"/>
            <interrupt index="27" name="PCINT3" caption="Pin Change Interrupt Request 3"/>
            <interrupt index="28" name="USART1_RX" caption="USART1 Rx Complete"/>
            <interrupt index="29" name="USART1_UDRE" caption="USART1, Data Register Empty"/>
            <interrupt index="30" name="USART1_TX" caption="USART1 Tx Complete"/>
            <interrupt index="31" name="USART1_START" caption="USART1 Start frame detection"/>
            <interrupt index="32" name="TIMER3_CAPT" caption="Timer/Counter3 Capture Event"/>
            <interrupt index="33" name="TIMER3_COMPA" caption="Timer/Counter3 Compare Match A"/>
            <interrupt index="34" name="TIMER3_COMPB" caption="Timer/Counter3 Compare Match B"/>
            <interrupt index="35" name="TIMER3_OVF" caption="Timer/Counter3 Overflow"/>
            <interrupt index="36" name="CFD" caption="Clock failure detection interrupt"/>
            <interrupt index="37" name="PTC_EOC" caption="PTC End of conversion"/>
            <interrupt index="38" name="PTC_WCOMP" caption="PTC Window comparator mode"/>
            <interrupt index="39" name="SPI1_STC" caption="SPI1 Serial Transfer Complete"/>
            <interrupt index="40" name="TWI1" caption="TWI Transfer Complete"/>
            <interrupt index="41" name="TIMER4_CAPT" caption="Timer/Counter4 Capture Event"/>
            <interrupt index="42" name="TIMER4_COMPA" caption="Timer/Counter4 Compare Match A"/>
            <interrupt index="43" name="TIMER4_COMPB" caption="Timer/Counter4 Compare Match B"/>
            <interrupt index="44" name="TIMER4_OVF" caption="Timer/Counter4 Overflow"/>
        </interrupts>
        <interfaces>
            <interface name="ISP" type="isp"/>
            <interface name="HVPP" type="hvpp"/>
            <interface name="debugWIRE" type="dw"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="JTAGID" value="0x9516"/>
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x95"/>
                <property name="SIGNATURE2" value="0x16"/>
            </property-group>
            <property-group name="OCD">
                <property name="OCD_REVISION" value="1"/>
                <property name="OCD_DATAREG" value="0x31"/>
                <property name="PROGBASE" value="0x0000"/>
            </property-group>
            <property-group name="ISP_INTERFACE">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="128"/>
                <property name="IspProgramFlash_delay" value="10"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="4"/>
                <property name="IspProgramEeprom_delay" value="20"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0F"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
            <property-group name="ISP_INTERFACE_STK600">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="128"/>
                <property name="IspProgramFlash_delay" value="6"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="4"/>
                <property name="IspProgramEeprom_delay" value="5"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE_STK600">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="20"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0F"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
            <property-group name="PP_INTERFACE_AVRDRAGON">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x0C 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0F"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="" name="FUSE">
                <register caption="" name="EXTENDED" offset="0x02" size="1" initval="0xF7">
                    <bitfield caption="Clock Failure Detection" mask="0x08" name="CFD" values="ENUM_CFD"/>
                    <bitfield caption="Brown-out Detector trigger level" mask="0x07" name="BODLEVEL"
                              values="ENUM_BODLEVEL"/>
                </register>
