bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA328PB.xml
                <register caption="Timer/Counter1 Output Compare Register Bytes" name="OCR1A" offset="0x88" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register Bytes" name="OCR1B" offset="0x8A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Input Capture Register Bytes" name="ICR1" offset="0x86" size="2"
                          mask="0xFFFF"/>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Prescaler Reset Timer/Counter1 and Timer/Counter0" mask="0x01" name="PSRSYNC"/>
                </register>
            </register-group>
            <register-group caption="" name="TC3">
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK3" offset="0x71" size="1">
                    <bitfield caption="Timer/Counter3 Input Capture Interrupt Enable" mask="0x20" name="ICIE3"/>
                    <bitfield caption="Timer/Counter3 Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE3B"/>
                    <bitfield caption="Timer/Counter3 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE3A"/>
                    <bitfield caption="Timer/Counter3 Overflow Interrupt Enable" mask="0x01" name="TOIE3"/>
                </register>
                <register caption="Timer/Counter3 Interrupt Flag register" name="TIFR3" offset="0x38" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter3 Input Capture Flag" mask="0x20" name="ICF3"/>
                    <bitfield caption="Output Compare Flag 3B" mask="0x04" name="OCF3B"/>
                    <bitfield caption="Output Compare Flag 3A" mask="0x02" name="OCF3A"/>
                    <bitfield caption="Timer/Counter3 Overflow Flag" mask="0x01" name="TOV3"/>
                </register>
                <register caption="Timer/Counter3 Control Register A" name="TCCR3A" offset="0x90" size="1">
                    <bitfield caption="Compare Output Mode bits" mask="0xC0" name="COM3A"/>
                    <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM3B"/>
                    <bitfield caption="Waveform Genration Mode" mask="0x03" name="WGM3"/>
                </register>
                <register caption="Timer/Counter3 Control Register B" name="TCCR3B" offset="0x91" size="1">
                    <bitfield caption="Input Capture Noise Canceler" mask="0x80" name="ICNC3"/>
                    <bitfield caption="Input Capture Edge Select" mask="0x40" name="ICES3"/>
                    <bitfield caption="Waveform Generation Mode bit 3" mask="0x10" name="WGM33"/>
                    <bitfield caption="Waveform Generation Mode bit 2" mask="0x08" name="WGM32"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS3" values="CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter3 Control Register C" name="TCCR3C" offset="0x92" size="1" ocd-rw="">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC3A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC3B"/>
                </register>
                <register caption="Timer/Counter3 Bytes" name="TCNT3" offset="0x94" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register Bytes" name="OCR3A" offset="0x98" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter3 Output Compare Register Bytes" name="OCR3B" offset="0x9A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter3 Input Capture Register Bytes" name="ICR3" offset="0x96" size="2"
                          mask="0xFFFF"/>
            </register-group>
            <register-group caption="" name="TC4">
                <register caption="Timer/Counter4 Interrupt Mask Register" name="TIMSK4" offset="0x72" size="1">
                    <bitfield caption="Timer/Counter4 Input Capture Interrupt Enable" mask="0x20" name="ICIE4"/>
                    <bitfield caption="Timer/Counter4 Output Compare Match B Interrupt Enable" mask="0x04"
                              name="OCIE4B"/>
                    <bitfield caption="Timer/Counter4 Output Compare Match A Interrupt Enable" mask="0x02"
                              name="OCIE4A"/>
                    <bitfield caption="Timer/Counter4 Overflow Interrupt Enable" mask="0x01" name="TOIE4"/>
                </register>
                <register caption="Timer/Counter4 Interrupt Flag register" name="TIFR4" offset="0x39" size="1"
                          ocd-rw="R">
                    <bitfield caption="Timer/Counter4 Input Capture Flag" mask="0x20" name="ICF4"/>
                    <bitfield caption="Output Compare Flag 4B" mask="0x04" name="OCF4B"/>
                    <bitfield caption="Output Compare Flag 4A" mask="0x02" name="OCF4A"/>
                    <bitfield caption="Timer/Counter4 Overflow Flag" mask="0x01" name="TOV4"/>
                </register>
                <register caption="Timer/Counter4 Control Register A" name="TCCR4A" offset="0xA0" size="1">
                    <bitfield caption="Compare Output Mode bits" mask="0xC0" name="COM4A"/>
                    <bitfield caption="Compare Output Mode bits" mask="0x30" name="COM4B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM4"/>
                </register>
                <register caption="Timer/Counter4 Control Register B" name="TCCR4B" offset="0xA1" size="1">
                    <bitfield caption="Input Capture Noise Canceler" mask="0x80" name="ICNC4"/>
                    <bitfield caption="Input Capture Edge Select" mask="0x40" name="ICES4"/>
                    <bitfield caption="Waveform Generation Mode bit 3" mask="0x10" name="WGM43"/>
                    <bitfield caption="Waveform Generation Mode bit 2" mask="0x08" name="WGM42"/>
                    <bitfield caption="Clock Select bits" mask="0x07" name="CS4" values="CLK_SEL_3BIT"/>
                </register>
                <register caption="Timer/Counter4 Control Register C" name="TCCR4C" offset="0xA2" size="1" ocd-rw="">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC4A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC4B"/>
                </register>
                <register caption="Timer/Counter4 Bytes" name="TCNT4" offset="0xA4" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register Bytes" name="OCR4A" offset="0xA8" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Output Compare Register Bytes" name="OCR4B" offset="0xAA" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter4 Input Capture Register Bytes" name="ICR4" offset="0xA6" size="2"
                          mask="0xFFFF"/>
            </register-group>
