bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA328PB.xml
                <register caption="Pin Change Mask Register 1" name="PCMSK1" offset="0x6C" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0x7F" name="PCINT" lsb="8"/>
                </register>
                <register caption="Pin Change Mask Register 0" name="PCMSK0" offset="0x6B" size="1">
                    <bitfield caption="Pin Change Enable Masks" mask="0xFF" name="PCINT"/>
                </register>
                <register caption="Pin Change Interrupt Flag Register" name="PCIFR" offset="0x3B" size="1" ocd-rw="R">
                    <bitfield caption="Pin Change Interrupt Flags" mask="0x0F" name="PCIF"/>
                </register>
            </register-group>
            <value-group caption="Interrupt Sense Control" name="INTERRUPT_SENSE_CONTROL">
                <value caption="Low Level of INTX" name="VAL_0x00" value="0x00"/>
                <value caption="Any Logical Change of INTX" name="VAL_0x01" value="0x01"/>
                <value caption="Falling Edge of INTX" name="VAL_0x02" value="0x02"/>
                <value caption="Rising Edge of INTX" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="" name="SPI">
            <register-group caption="" name="SPI0">
                <register caption="SPI Data Register" name="SPDR0" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="SPI Status Register" name="SPSR0" offset="0x4D" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Control Register" name="SPCR0" offset="0x4C" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
                </register>
            </register-group>
            <register-group caption="" name="SPI1">
                <register caption="SPI Data Register" name="SPDR1" offset="0xAE" size="1" mask="0xFF" ocd-rw=""/>
                <register caption="SPI Status Register" name="SPSR1" offset="0xAD" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF1"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL1"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X1"/>
                </register>
                <register caption="SPI Control Register" name="SPCR1" offset="0xAC" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE1"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE1"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD1"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR1"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL1"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA1"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR1" values="COMM_SCK_RATE_3BIT"/>
                </register>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE_3BIT">
                <value caption="fosc/2 or fosc/4" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/8 or fosc/16" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/32 or fosc/64" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/64 or fosc/128" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="" name="WDT">
            <register-group caption="" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
                    <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS"/>
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="" name="CFD">
            <register-group caption="" name="CFD">
                <register caption="XOSC Failure Detection Control and Status Register" name="XFDCSR" offset="0x62"
                          size="1">
                    <bitfield caption="Failure Detection Interrupt Flag" mask="0x02" name="XFDIF"/>
                    <bitfield caption="Failure Detection Interrupt Enable" mask="0x01" name="XFDIE"/>
                </register>
            </register-group>
        </module>
